
# CrazyCoin百币年鉴——EOS(柚子) 

### 序
写在前面，百币年鉴CrazyCoin由区块链爱好者币圈1024哥WX：bqdn1024基于初学者角度编辑制作的目前市场上热门币种的系统性介绍资料，希望在自我学习的同时能够分享给更多的币圈朋友，旨在共同学习研究区块链技术与产业发展，由浅入深共同见证币圈的未来。如有不足之处，还请多提意见。

### EOS(柚子) 人话简介

**EOS**是Block.One公司正在研发的一个区块链底层公链系统，目的是解决现有的区块链应用性能低、安全性差、开发难度高以及过度依赖手续费的问题，实现分布式应用的性能扩展。EOS 提供帐户，身份验证，数据库，异步通信以及在数以百计的CPU或群集上的程序调度。该技术的最终形式是一个区块链体系架构，该区块链每秒可以支持数百万个交易，同时普通用户无需支付使用费用。虽然随着公链以太坊ETH智能合约的推出，丰富了区块链的商业应用，但离真正的大规模商业级应用还有很大的缺陷，EOS的目标是成为一个真正能支持大量商业级应用的公链。

### EOS(柚子) 正经信息  ==数据更新时间：2018.4.27==

**项目名称：**| **Enterprise Operation System**|**符号/昵称：**|**EOS（柚子）**
----------- | ----------- | ------------- | -------------
**发行时间：** | **2017.06.06** | **发行总量：**| **9亿**
**官方网站：**| **https://eos.io/**  | **白皮书：** | **https://github.com/EOSIO**
**创始人/机构：**  | **BM（Dan Larimer）** | **底层语言：** | **JavaScript、C++、C**
**共识算法：** | **DPOS**  | **出块时间：**| **3秒**
**加入Q群：** | **579464896**  | **加入微信群：**| **加作者wx：hey2hey进群**


### EOS(柚子) 逼格事件

 - ==2017.06.06== EOS发行！区块链初创公司block.one以发行EOS加密货币，即ICO（首次公开发行代币）的形式筹资1.85亿美元，创下历史记录。总部位于香港的block.one公司近期宣布，公司已经通过发行加密货币EOS，在5天内筹得了1.85亿美元。第一阶段的发售时间是2017年6月6日至7月1日，该阶段配置有总共2亿的代币。第二阶段将于2017年7月1日开始，该阶段将发行7亿EOS代币。余下的1亿代币将由block.one团队储备，不可交易和转移。
 - ==2017.07.10== EOS与FinTech Worldwide合作，在欧洲和美国举办了4场系列会议，第一站是7月10日至14日的伦敦金融科技周。
 - ==2017.10.08== Block.one的CEO宣布EOS将会把它在代币销售过程中筹集到的十亿美金用于EOS项目的建设。
 - ==2017.11.28== 由Cointelegraph发起的全球盛会BlockShow Asia已经隆重宣布与EOS.IO建立合作伙伴关系。
 - ==2017.12.04== EOS项目方Block.One正式发布了EOS.IO的2.0版单线程应用测试网络，这也意味着主网的开发进度比计划提前了8个月，从而确保EOS.IO能在2018年6月1日顺利问世。
 - ==2018.01.13== EOS在韩国首尔举办了一次线下的MeetUp，分享人包括EOS的合伙人、市场运营人员、技术人员以及基于EOS开发的第一个项目介绍。整个会场座无虚席，并且线上直播人数也达到几十万人。
 - ==2018.01.16== EOS VC 首个合作伙伴公布！EOS的母公司BLOCK.ONE今天在丹佛宣布与TOMORROW BLOCKCHAIN OPPORTUNITIES（“TomorrowBC”）一起创建一个基金，专门投资于EOS.IO生态软件。
 - ==2018.04.06== EOS见面会在香港举行，合伙人指出超级节点可应对“黑天鹅”，在会上宣布了DAWN3.0发布，并详细介绍了DAWN3.0的技术特点。Block.one宣布与业内知名投资者Michael Cao和Winnie Liu建立合作伙伴关系，该合作计划成立一个2亿美元合资投资基金——EOS Global。目标是加速以亚洲为重点的EOSIO生态系统开发。



### EOS(柚子) 大咖秀场

**Brendan Blummer** CEO

Block.one和EOS的CEO及联合创始人，业内昵称“BB”。在他十五岁时，就创办了Gamecliff来销售游戏中的虚拟资产，后被网络游戏公司IGE收购。此外，他还是The Account Network、Okay.com和ii5的联合创始人创始人及CEO。正是因为BB的专业度，业内传奇人物BM仅担任EOS的CTO，专注于EOS的开发，不再用他的极客思维干扰项目运营。他还开通了中国微博，感兴趣可以关注下。

**Daniel Larimer** CTO

是Block.one和EOS的CTO及联合创始人，江湖传闻的BM（其在GitHub上名字为Bytemaster“字节大师”），毕业于佛吉尼亚大学计算机系。他可能是目前世界上唯一一个连续成功开发了三个基于区块链技术的去中心化系统的人。除了EOS之外，他也是世界上第一个去中心化交易平台BItShares创始人、区块链社交媒体平台Steemit的CTo和联合创始人。他在2010年7月在Bitcointalk怼过中本聪，向中本聪指出改变共识机制可以减少比特币交易确认时间，于是，他创造了DPOS共识机制。

**Brock Pierce** 合伙人

Brock Pierce是EOS的合作伙伴，他是一位风险投资家和企业家，率先在游戏中使用数字货币，并为他创立的公司筹集超过五亿美元资金。他是去中心化的倡导者，是比特币早起投资者，也是以太坊的最大投资者之一。同时他还是比特币基金会主席，Blockchain Capital联合创始人，Block.one联合创始人兼战略主管，Mastercoin创始董事会成员（第一届ICO）。此外，他还是美国奇点大学的教授。

**Ian Grigg** 合伙人

Ian Grigg是一名金融密码学家，目前，他同时担任Mattereum的首席科学家，Youbank的顾问，Block.one的合伙人，P2P Practice的独立顾问，Akropolis的顾问，Solidus的CTO，R3区块链的架构师等多个职位。他建立了加密分类账平台，发明了“里卡德契约”，还是“三式记账法”的共同发明人。他经常发一些关于区块链的文章，在他的主页上还有关于金融密码学的定义。


### EOS(柚子) 八卦小道

- `1) EOS众筹时间是一年！`
分两个阶段：2017年6月25日-30日为众筹第一阶段，此阶段共出售2亿代币，这个阶段兑换比例是一定的，1ETH≈306 EOS；2017年7月1日—2018年6月2日为众筹的第二个阶段，每天只发放200万代币，兑换比例按当日投入的ETH总量确定。
EOS第一阶段众筹结束后火速上线了云币网，就这样，EOS成为了第一个一边众筹一边在交易所交易的代币了！EOS的众筹方式是史无前例，很多已经习惯于傻瓜式梭哈的老司机完全没有耐心去研究这个众筹方式，再加上BM的黑历史，直接PASS了EOS。第一阶段的EOS众筹成本大概是6~7元，上云币第一天，价格就一路飙升，最高涨到37左右，很多币友怕参与众筹价格的不确定性，就直接在交易所追涨杀进去了，最终成为了站在山顶上的韭菜。众筹时间一长吧，这故事就多了，最有意思的可能还是要请出我们的笑来大叔了，笑来大叔作为EOS的“前”项目顾问，自己的项目Press.one 和Big.one众筹都接受EOS为众筹代币，很多没有参与众筹的币友就这样在30多元的山顶，冲进去买了EOS，期待着暴富…
谁曾想监管来临，遭遇退币，等币友拿回退的EOS时，价格已经跌到11块左右了，简直比破发都丧心病狂。而此时，EOS却和大叔撇清了关系，导致一大波币友狂喷笑来。监管之后，EOS一路下跌，最低仅3元，官网的众筹看着很萧条，参与量很低，交易所的交易量也都很一般，但基本众筹和交易所的价格都是持平的，个人觉得，这个操作细思极恐，很6有木有！？

- `2）EOS众筹地址转出41.4万个ETH，V神被砸哭？`
2018年4月10日，EOS众筹地址转出了41.4万个ETH，这是要干嘛？难道昨晚的ETH突然下跌与此有关？眼看就要到EOS主网上线的日子了，各大交易所以及钱包都相继支持了EOS的映射，大家就盼着EOS主网上线，能带动新一轮的牛市，现在转出这么多ETH，莫非这是公司运营需要？还是说，要大量买进EOS，吸筹抬高价格？But！EOS从昨晚到现在都没怎么变！这些如果都不是，难道是要将这40万ETH变现砸盘，要是这样的话，ETH势必又将迎来一波下跌！话说EOS将来的野心是取代ETH，现在做出这样的行为！动机很不纯洁呀！
币转出之后，立即又从这个官方地址转出10万ETH到另一个地址。关注EOS的新老韭菜们应该记得半个月前，EOS众筹地址就转出了62万的ETH，后续还会不会继续转出，就不得而知了！掰掰手指头算一下，40万个ETH按照当时的价格，1ETH=2500人民币，40万ETH就是10亿人民币！不会是创始人要变现跑路吧？应该不会吧，这种话可不敢乱说！大家可以去仔细看看EOS这个项目到底如何。

### 你不是一个人在币圈，找我入伙！
币圈1024哥微信号：hey2hey(请备注github)

币圈1024哥QQ号：1055646900(请备注github)

币圈等你微信订阅号：bqdn1024

1024区块链学院QQ群：579464896

币乎专栏：https://bihu.com/people/356301

